hevakelcj/STM32-Workspace/SourceStore/drive/usart.c
/************************************************************************************
 *  Copyright (c), 2009 -  , XXXX软件有限公司
 *            All rights reserved.
 *
 * File name: usart.c
 * Project  : STM32F10X
 * Processor: STM32F10X
 * Compiler : ARM Compiler
 * 
 * Author : 李春君
 * Version: 1.00
 * Date   : 2011.7.4 
 * Email  : hevake_lcj@126.com
 * Modification: none
 * 
 * Description: 
 *   USART驱动 
 *
 * Others: none;
 *      	
 * Function List: 
 *   
 * History:
 *   1. Author:       none  
 *	    Version: 	  0.0
 *	    Date:         2011.XX.XX
 *      Modification: none
 *
 ************************************************************************************
 */

/**
 ====================================================================================
 |  							   文  件  包  含									|
 |																					|
 |  NOTE: 																			|
 ====================================================================================
 */
#include "usart.h"
#include "stm32f10x.h"
#include <stdio.h>
#include "includes.h"
#include "delay.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_gpio.h"
#include "misc.h"

/**
 ====================================================================================
 |  							   变  量  定  义									|
 |																					|
 |  NOTE: 																			|
 ====================================================================================
 */
USART_TypeDef*	usart_connect_with = NULL ;		//与USART2相联的串口
USART_TypeDef*	usart_list[5] = {NULL,USART2,USART3,UART4,UART5};

/**
 ====================================================================================
 |  							   函  数  定  义									|
 |																					|
 |  NOTE: 																			|
 ====================================================================================
 */

/**
  *********************************************************************************
  * @Function: SetUART1ConnectWith;
  *
  * @Description:	设置与USART1对连的串口
  *           
  * @Input:  --uart 串口号;
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:
  ***********************************************************************************
  */
void	SetUART1ConnectWith( USART_TypeEnum uart)
{
	if (uart >= USART_MAX){
		return;
	}
	usart_connect_with = usart_list[uart];
}

/**
  *********************************************************************************
  * @Function: GetUART1ConnectWith;
  *
  * @Description:	获取与USART1对连的串口
  *           
  * @Input:  none;
  *
  * @Output: none;
  *          		
  * @Return: USART_TypeDef 串口模块地址;
  *
  * @Note:
  ***********************************************************************************
  */
USART_TypeDef* GetUART1ConnectWith()
{
	return usart_connect_with;
}


/**
  *********************************************************************************
  * @Function: USART_SetBaudRate;
  *
  * @Description:	设置波特率
  *           
  * @Input:  --usart ;
  *          --baudRate   波特率	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   USARTx->BRR = Fclk / baudRate ;
  ***********************************************************************************
  */
void	USART_SetBaudRate(USART_TypeDef *usart , INT32U baudRate)
{
	RCC_ClocksTypeDef Clocks;
	INT32U	tmp = 0 ; 

	assert_param(IS_USART_ALL_PERIPH(usart));

	RCC_GetClocksFreq(&Clocks);	//获取时钟

	if(usart==USART1){
		tmp = Clocks.PCLK2_Frequency ;
	}else{
		tmp = Clocks.PCLK1_Frequency ;
	}

	tmp /= baudRate ;

	usart->BRR = tmp ;
}

/**
  *********************************************************************************
  * @Function: USART_GetBaudRate;
  *
  * @Description:	获取波特率
  *           
  * @Input:  --usart ;
  *
  * @Output: none;
  *          		
  * @Return: INT32U	波特率;
  *
  * @Note:   baudRate = Fclk / USARTx->BRR ;
  ***********************************************************************************
  */
INT32U	USART_GetBaudRate(USART_TypeDef *usart)
{
	RCC_ClocksTypeDef Clocks;
	INT32U	ret = 0 ;
	INT32U	tmp = 0 ; 

	assert_param(IS_USART_ALL_PERIPH(usart));

	tmp = usart->BRR ;
	RCC_GetClocksFreq(&Clocks);	//获取时钟

	if(usart==USART1){
		ret = Clocks.PCLK2_Frequency ;
	}else{
		ret = Clocks.PCLK1_Frequency ;
	}

	ret /= tmp ;	

	return	ret ;
}

/**
  ===================================================================================
  |																					|
  |             USART1模块  														|
  |																					|
  |---------------------------------------------------------------------------------|
  | @ 全局变量 :																	|
  |		file_usart1 	USART1文件结构  											|
  | 																				|
  | @ 函数列表 :																	|
  |     void	USART1_Init()														|
  |		void	USART1_SendData( char ch )											|
  | 	char	USART1_ReceiveData( void )											|
  ===================================================================================
  */

/**
  *********************************************************************************
  * @Function: USART1_init;
  *
  * @Description:	初始化USART1串行接口，配置相关的引脚
  *           
  * @Input:  none;	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   TX-->PA9
  *          RX-->PA10
  ***********************************************************************************
  */
void	USART1_Init()
{	
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	GPIO_InitTypeDef  GPIO_InitStructure;

	//给USART1提供时钟
	RCC_APB2PeriphClockCmd(RCC_APB2ENR_USART1EN | RCC_APB2ENR_AFIOEN, ENABLE);	

#if USART1_REMAP == 0
	/**
	  * 引脚配置 	
	  * TX -> PA9  推挽输出 1011
	  * RX -> PA10 悬浮输入 0100
	  */
	//给GPIOA提供时钟
	RCC_APB2PeriphClockCmd( RCC_APB2ENR_IOPAEN, ENABLE);	
	GPIO_PinRemapConfig(GPIO_Remap_USART1, DISABLE);	//不重映射
		
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_9 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_10 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU ;
	GPIO_Init(GPIOA,&GPIO_InitStructure);

#else  // if USART1_REMAP == 1
	/**
	  * 引脚配置 	
	  * TX -> PB6  推挽输出 1011
	  * RX -> PB7  悬浮输入 0100
	  */
	  
