hevakelcj/STM32-Workspace/SourceStore/drive/usart.c
	//给GPIOB提供时钟
	RCC_APB2PeriphClockCmd( RCC_APB2ENR_IOPBEN, ENABLE);
	GPIO_PinRemapConfig(GPIO_Remap_USART1, ENABLE);	//重映射
		
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_6 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOB,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_7 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU ;
	GPIO_Init(GPIOB,&GPIO_InitStructure);

#endif //USART1_REMAP == 0

#if	USART1_DR == 1
	/*
	 * R/D0 -> PA8 配置成推挽输出
	 */
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_8 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	GPIO_ResetBits(GPIOA,GPIO_Pin_8);
#endif	//USART1_DR == 1

	USART_InitStructure.USART_BaudRate            = USART1_INIT_BAUDRATE  ;
	USART_InitStructure.USART_WordLength          = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits            = USART_StopBits_1;
	USART_InitStructure.USART_Parity              = USART_Parity_No ;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(USART1, &USART_InitStructure);
	USART_ITConfig(USART1, USART_IT_RXNE , ENABLE);
	USART_Cmd(USART1, ENABLE); 

	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/**
  *********************************************************************************
  * @Function: USART1_SendData;
  *
  * @Description:	从USART1串行接口发送1个字节数据
  *           
  * @Input:  ch         要发送的数据	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   none;
  ***********************************************************************************
  */
void	USART1_SendData( char ch )
{
	if(usart_connect_with)
		return ;

#if	USART1_DR == 1
	GPIO_SetBits(GPIOA,GPIO_Pin_8);
#endif	//USART1_DR == 1

	USART_SendData(USART1,ch);
	
#if	USART1_DR == 1
	while( !( USART1->SR & USART_SR_TC ) );	//等待数据发送完毕
	GPIO_ResetBits(GPIOA,GPIO_Pin_8);
#endif	//USART1_DR == 1
}

/**
  *********************************************************************************
  * @Function: USART1_ReceiveData;
  *
  * @Description:	从USART1接口接收1个字节数据
  *           
  * @Input:  none;	
  *
  * @Output: none;
  *          		
  * @Return: char       接收到的数据;
  *
  * @Note:   none;
  ***********************************************************************************
  */
char	USART1_ReceiveData( void )
{
	return	USART_ReceiveData(USART1) ;
}

/**
  ===================================================================================
  |																					|
  |             USART2模块  														|
  |																					|
  |---------------------------------------------------------------------------------|
  | @ 全局变量 :																	|
  |		file_usart2 	USART2文件结构  											|
  | 																				|
  | @ 函数列表 :																	|
  |     void	USART2_Init()														|
  |		void	USART2_SendData( char ch )											|
  | 	char	USART2_ReceiveData( void )											|
  ===================================================================================
  */

/**
  *********************************************************************************
  * @Function: USART2_Init;
  *
  * @Description:	初始化USART2串行接口，配置相关的引脚
  *           
  * @Input:  none;	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   TX-->PD5
  *          RX-->PD6
  ***********************************************************************************
  */
void	USART2_Init()
{
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef  NVIC_InitStructure;
	GPIO_InitTypeDef  GPIO_InitStructure;

	//给USART2与GPIOD提供时钟
	RCC_APB1PeriphClockCmd(RCC_APB1ENR_USART2EN | RCC_APB2ENR_AFIOEN, ENABLE); 	//给USART2模块提供时钟
	
#if USART2_REMAP == 0
	/**
	  * 引脚配置 	
	  * 无映射
	  * TX -> PA2 推挽输出 1011
	  * RX -> PA3 悬浮输入 0100
	  */
	RCC_APB2PeriphClockCmd(RCC_APB2ENR_IOPAEN, ENABLE);		//给GPIOA模块提供时钟
	GPIO_PinRemapConfig(GPIO_Remap_USART2,DISABLE);	//不重映射

	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_2 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_3 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU ;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
#else
	/**
	  * 引脚配置 	
	  * 重映射
	  * TX -> PD5 推挽输出 1011
	  * RX -> PD6 悬浮输入 0100
	  */
	RCC_APB2PeriphClockCmd(RCC_APB2ENR_IOPDEN, ENABLE);		//给GPIOD模块提供时钟
	GPIO_PinRemapConfig(GPIO_Remap_USART2,ENABLE);	//重映射
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_5 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOD,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_6 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU ;
	GPIO_Init(GPIOD,&GPIO_InitStructure);
			
#endif //USART2_REMAP == 0

#if	USART2_DR == 1
	/*
	 * R/D1 -> PA1 配置成推挽输出
	 */
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_1 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	GPIO_ResetBits(GPIOA,GPIO_Pin_1);
#endif  //USART2_DR == 1

	USART_InitStructure.USART_BaudRate            = USART2_INIT_BAUDRATE  ;
	USART_InitStructure.USART_WordLength          = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits            = USART_StopBits_1;
	USART_InitStructure.USART_Parity              = USART_Parity_No ;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(USART2, &USART_InitStructure);
	USART_ITConfig(USART2, USART_IT_RXNE , ENABLE);
	USART_Cmd(USART2, ENABLE); 

	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/**
  *********************************************************************************
  * @Function: USART2_SendData;
  *
  * @Description:	从USART2串行接口发送1个字节数据
  *           
  * @Input:  ch         要发送的数据	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   none;
  ***********************************************************************************
  */
void	USART2_SendData( char ch )
{
	if(usart_connect_with==USART2)
		return ;

