hevakelcj/STM32-Workspace/SourceStore/drive/usart.c
#if	USART2_DR == 1
	GPIO_SetBits(GPIOA,GPIO_Pin_1);
#endif  //USART2_DR == 1
	
	USART_SendData(USART2,ch);

#if	USART2_DR == 1
	while( !( USART2->SR & USART_SR_TC ) );	//等待数据发送完毕
	GPIO_ResetBits(GPIOA,GPIO_Pin_1);
#endif  //USART2_DR == 1
}

/**
  *********************************************************************************
  * @Function: USART2_ReceiveData;
  *
  * @Description:	从USART2接口接收1个字节数据
  *           
  * @Input:  none;	
  *
  * @Output: none;
  *          		
  * @Return: char       接收到的数据;
  *
  * @Note:   none;
  ***********************************************************************************
  */
char	USART2_ReceiveData( void )
{
	return	USART_ReceiveData(USART2) ;
}

/**
  ===================================================================================
  |																					|
  |             USART3模块  														|
  |																					|
  |---------------------------------------------------------------------------------|
  | @ 全局变量 :																	|
  |		file_usart3 	USART3文件结构  											|
  | 																				|
  | @ 函数列表 :																	|
  |     void	USART3_Init()														|
  |		void	USART3_SendData( char ch )											|
  | 	char	USART3_ReceiveData( void )											|
  ===================================================================================
  */

/**
  *********************************************************************************
  * @Function: USART3_Init;
  *
  * @Description:	初始化USART3串行接口，配置相关的引脚
  *           
  * @Input:  none;	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   TX-->PD5
  *          RX-->PD6
  ***********************************************************************************
  */
void	USART3_Init()
{
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef  NVIC_InitStructure;
	GPIO_InitTypeDef  GPIO_InitStructure;

	//给USART3提供时钟
	RCC_APB1PeriphClockCmd(RCC_APB1ENR_USART3EN | RCC_APB2ENR_AFIOEN, ENABLE); 	//给USART3模块提供时钟

#if USART3_REMAP == 0

	RCC_APB2PeriphClockCmd(	RCC_APB2ENR_IOPBEN | RCC_APB2ENR_IOPDEN, ENABLE);		//给GPIOB,GPIOD模块提供时钟
	/**
	  * 引脚配置 	
	  * 无重映射
	  * TX -> PB10 推挽输出 1011
	  * RX -> PD11 悬浮输入 0100
	  */
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_10 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOB,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_11 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU ;
	GPIO_Init(GPIOB,&GPIO_InitStructure);		

#elif USART3_REMAP == 1

	RCC_APB2PeriphClockCmd(RCC_APB2ENR_IOPCEN | RCC_APB2ENR_AFIOEN ,ENABLE);		//给GPIOD模块提供时钟
	/**
	  * 引脚配置 	
	  * 部分重映射
	  * TX -> PC10 推挽输出 1011
	  * RX -> PC11 悬浮输入 0100
	  */
	GPIO_PinRemapConfig(GPIO_PartialRemap_USART3, ENABLE);	//重映射
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_10 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOC,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_11 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU ;
	GPIO_Init(GPIOC,&GPIO_InitStructure);		

#elif USART3_REMAP == 2

	RCC_APB2PeriphClockCmd(RCC_APB2ENR_IOPDEN | RCC_APB2ENR_AFIOEN ,ENABLE);		//给GPIOD模块提供时钟
	/**
	  * 引脚配置 	
	  * 重映射
	  * TX -> PD8 推挽输出 1011
	  * RX -> PD9 悬浮输入 0100
	  */
	GPIO_PinRemapConfig(GPIO_FullRemap_USART3,ENABLE);	//重映射
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_8 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOD,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_9 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU ;
	GPIO_Init(GPIOD,&GPIO_InitStructure);		

#endif

	USART_InitStructure.USART_BaudRate            = USART3_INIT_BAUDRATE  ;
	USART_InitStructure.USART_WordLength          = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits            = USART_StopBits_1;
	USART_InitStructure.USART_Parity              = USART_Parity_No ;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(USART3, &USART_InitStructure);
	USART_ITConfig(USART3, USART_IT_RXNE , ENABLE);
	USART_Cmd(USART3, ENABLE); 

	NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/**
  *********************************************************************************
  * @Function: USART3_SendData;
  *
  * @Description:	从USART3串行接口发送1个字节数据
  *           
  * @Input:  ch         要发送的数据	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   none;
  ***********************************************************************************
  */
void	USART3_SendData( char ch )
{
	if(usart_connect_with==USART3)
		return ;

	USART_SendData(USART3,ch);
}

/**
  *********************************************************************************
  * @Function: USART3_ReceiveData;
  *
  * @Description:	从USART3接口接收1个字节数据
  *           
  * @Input:  none;	
  *
  * @Output: none;
  *          		
  * @Return: char       接收到的数据;
  *
  * @Note:   none;
  ***********************************************************************************
  */
char	USART3_ReceiveData( void )
{
	return	USART_ReceiveData(USART3) ;
}

#ifdef STM32F10X_CL

/**
  ===================================================================================
  |																					|
  |             UART4模块  															|
  |																					|
  |---------------------------------------------------------------------------------|
  | @ 全局变量 :																	|
  |		file_uart4	UART4文件 												|
  | 																				|
  | @ 函数列表 :																	|
  |     void	UART4_Init()														|
  |		void	UART4_SendData( char ch )											|
  | 	char	UART4_ReceiveData( void )											|
  ===================================================================================
  */

/**
  *********************************************************************************
  * @Function: UART4_Init;
  *
  * @Description:	初始化USART1串行接口，配置相关的引脚
  *           
  * @Input:  none;	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   TX-->PC10
  *          RX-->PC11
  ***********************************************************************************
  */
void	UART4_Init()
{	
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef  NVIC_InitStructure;
	GPIO_InitTypeDef  GPIO_InitStructure;

	//给UART4与GPIOD提供时钟
	RCC_APB1PeriphClockCmd(RCC_APB1ENR_UART4EN,ENABLE); 	//给UART4模块提供时钟
	RCC_APB2PeriphClockCmd(RCC_APB2ENR_IOPCEN | RCC_APB2ENR_AFIOEN ,ENABLE);		//给GPIOC模块提供时钟
	/**
	  * 引脚配置 	
	  * 重映射
	  * TX -> PC10 推挽输出
	  * RX -> PC11 悬浮输入
	  */
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_10 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOC,&GPIO_InitStructure);
	
