hevakelcj/STM32-Workspace/SourceStore/drive/usart.c
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_11 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU ;
	GPIO_Init(GPIOC,&GPIO_InitStructure);		

	USART_InitStructure.USART_BaudRate            = UART4_INIT_BAUDRATE  ;
	USART_InitStructure.USART_WordLength          = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits            = USART_StopBits_1;
	USART_InitStructure.USART_Parity              = USART_Parity_No ;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(UART4, &USART_InitStructure);
	USART_ITConfig(UART4, USART_IT_RXNE , ENABLE);
	USART_Cmd(UART4, ENABLE); 

	NVIC_InitStructure.NVIC_IRQChannel = UART4_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/**
  *********************************************************************************
  * @Function: UART4_SendData;
  *
  * @Description:	从USART1串行接口发送1个字节数据
  *           
  * @Input:  ch         要发送的数据	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   none;
  ***********************************************************************************
  */
void	UART4_SendData( char ch )
{
	if(usart_connect_with==UART4)
		return ;

	USART_SendData(UART4,ch);
}

/**
  *********************************************************************************
  * @Function: UART4_ReceiveData;
  *
  * @Description:	从UART4接口接收1个字节数据
  *           
  * @Input:  none;	
  *
  * @Output: none;
  *          		
  * @Return: char       接收到的数据;
  *
  * @Note:   none;
  ***********************************************************************************
  */
char	UART4_ReceiveData( void )
{
	Delay_us(20);
	return	USART_ReceiveData(UART4) ;
}

/**
  ===================================================================================
  |																					|
  |             UART5模块  															|
  |																					|
  |---------------------------------------------------------------------------------|
  | @ 全局变量 :																	|
  |		file_uart5	UART5文件 												|
  | 																				|
  | @ 函数列表 :																	|
  |     void	UART5_Init()														|
  |		void	UART5_SendData( char ch )											|
  | 	char	UART5_ReceiveData( void )											|
  ===================================================================================
  */

/**
  *********************************************************************************
  * @Function: UART5_Init;
  *
  * @Description:	初始化USART1串行接口，配置相关的引脚
  *           
  * @Input:  none;	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   TX-->PC12
  *          RX-->PD2
  ***********************************************************************************
  */
void	UART5_Init()
{
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef  NVIC_InitStructure;
	GPIO_InitTypeDef  GPIO_InitStructure;

	//给UART5与GPIOD提供时钟
	RCC_APB1PeriphClockCmd(RCC_APB1ENR_UART5EN,ENABLE); 	//给UART5模块提供时钟
	RCC_APB2PeriphClockCmd(RCC_APB2ENR_IOPCEN | RCC_APB2ENR_IOPCEN | RCC_APB2ENR_AFIOEN ,ENABLE);		//给GPIOC,GPIOD模块提供时钟
	/**
	  * 引脚配置 	
	  * 重映射
	  * TX -> PC12 推挽输出
	  * RX -> PD2  悬浮输入
	  */
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_12 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz ;
	GPIO_Init(GPIOC,&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_2 ;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU ;
	GPIO_Init(GPIOD,&GPIO_InitStructure);		

	USART_InitStructure.USART_BaudRate            = UART5_INIT_BAUDRATE  ;
	USART_InitStructure.USART_WordLength          = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits            = USART_StopBits_1;
	USART_InitStructure.USART_Parity              = USART_Parity_No ;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(UART5, &USART_InitStructure);
	USART_ITConfig(UART5, USART_IT_RXNE, ENABLE);
	USART_Cmd(UART5, ENABLE); 

	NVIC_InitStructure.NVIC_IRQChannel = UART5_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/**
  *********************************************************************************
  * @Function: UART5_SendData;
  *
  * @Description:	从USART1串行接口发送1个字节数据
  *           
  * @Input:  ch         要发送的数据	
  *
  * @Output: none;
  *          		
  * @Return: none;
  *
  * @Note:   none;
  ***********************************************************************************
  */
void	UART5_SendData( char ch )
{
	if(usart_connect_with==UART5)
		return ;

	USART_SendData(UART5,ch);
}

/**
  *********************************************************************************
  * @Function: UART5_ReceiveData;
  *
  * @Description:	从UART5接口接收1个字节数据
  *           
  * @Input:  none;	
  *
  * @Output: none;
  *          		
  * @Return: char       接收到的数据;
  *
  * @Note:   none;
  ***********************************************************************************
  */
char	UART5_ReceiveData( void )
{	
	Delay_us(20);
	return	USART_ReceiveData(UART5) ;
}

#endif //STM32F10X_CL
